musicapp/app/models/user.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def ensure_session_token
        self.session_token ||= User.generate_session_token
        self.save!

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ashztodd@gmail.com"], ["LIMIT", 1]]
---
    def self.find_by_credentials(email, password)
        user = self.find_by(email: email)